package Example.Example_18;

/*
 * 파일 시스템 (File System) 이란?
 * - 파일을 관리하고 제어 할 수 있는 기능을 의미한다. (+ 즉, 파일 시스템을 활용하면 반영구적으로 데이터를
 * 저장하는 것이 가능하다.)
 *
 * 프로그램은 주 기억 장치 (+ Ex. 메모리) 상에 위치하기 때문에 프로그램이 종료되고 나면
 * 프로그램이 사용하고 있던 데이터도 모두 사라지는 단점이 존재한다. (+ 즉, 변수는 주 기억 장치 상에 선언 된다는 것을
 * 알 수 있다.)
 *
 * 따라서 프로그램이 사용하고 있던 데이터를 반영구적으로 저장하기 위해서는 주 기억 장치가 아닌
 * 다른 기억 장치 (+ Ex. 보조 기억 장치) 에 저장 할 필요가 있으며 이때 파일을 활용하는 것이 가능하다. (+ 즉, 파일은
 * 보조 기억 장치 상에 생성 된다는 것을 알 수 있다.)
 *
 * 프로그램은 사용하고 있던 데이터를 파일에 저장하고 읽어들임으로서 데이터를 반영구적으로 유지하는 것이 가능하다.
 * (+ 즉, 프로그램이 실행 될 때 파일에 존재하는 데이터를 읽어들임으로서 이전에 실행 되었을 때 사용한 데이터를 계속
 * 유지한다는 것을 의미한다.)
 */

/**
 * Example 18 (파일 시스템)
 */
public class CE01Example_18 {
	/** 초기화 */
	public static void start(String[] args) {
		// Do Something
	}
}
