/*
 * import 키워드란?
 * - 특정 패키지를 가져오는 역할을 수행한다. (+ 즉, import 키워드를 활용하면 Java 가 지원하는 다양한 패키지를
 * 가져와서 활용하는 것이 가능하다.)
 *
 * Java 는 다양한 패키지를 지원하며 이러한 패키지를 활용하면 프로그램을 좀 더 수월하게 제작하는 것이 가능하다. (+ 즉,
 * 이미 완성 된 기능을 재활용함으로서 작성해야되는 명령문을 줄이는 것이 가능하다.)
 *
 * 패키지 (Package) 란?
 * - 다양한 클래스를 그룹화시키는 기능을 의미한다. (+ 즉, 패키지 내부에는 여러 기능이 모여있다는 것을 알 수 있다.)
 *
 * Java 는 패키지 단위로 연관 된 기능이 그룹화되어있기 때문에 특정 패키지를 가져옴으로서 해당 패키지 하위에 존재하는
 * 여러 기능을 활용하는 것이 가능하다.
 */
import Example.Example_01.CExample_01;
import Example.Example_02.CExample_02;
import Example.Example_03.CExample_03;
import Example.Example_04.CExample_04;
import Example.Example_05.CExample_05;
import Example.Example_06.CExample_06;

import Training.Training_01.CTraining_01;
import Training.Training_02.CTraining_02;

/*
 * 클래스 (Class) 란?
 * - 연관 된 변수 or 메서드 등을 그룹화시킬 수 있는 기능을 의미한다. (+ 즉, 클래스 내부에는 여러 기능이 존재한다는
 * 것을 알 수 있다.)
 *
 * Java 는 객체 지향 프로그래밍 언어이기 때문에 명령문을 작성 할 수 있는 위치가 정해져있으며 그중 하나가 메서드이다.
 * (즉, 메서드 내부에 여러 명령문을 작성함으로서 특정 목적에 맞는 프로그램을 제작하는 것이 가능하다.)
 *
 * 메서드 (Method) 란?
 * - 특정 역할을 수행하는 하나의 기능을 의미한다. (+ 즉, 메서드를 호출하면 해당 메서드 내부에 존재하는 명령문이
 * 실행된다는 것을 알 수 있다.)
 *
 * Java 명령문은 메서드 내부에 작성하는 것이 가능하며 이러한 명령문은 메서드가 호출됨으로서 실행하는 것이 가능하다.
 * (+ 즉, 메서드가 호출되지 않으면 메서드 내부에 존재하는 명령문이 동작하지 않는다는 것을 의미한다.)
 *
 * 주석이란?
 * - 사용자 (프로그래머) 를 위한 기능으로서 메모를 작성 할 수 있는 기능을 의미한다. (+ 즉, 주석은
 * Java 컴파일러에 의해서 기계어로 변환되지 않는다는 것을 알 수 있다.)
 *
 * Jav 주석 종류
 * - 단일 행 주석
 * - 다중 행 주석
 *
 * 위와 같이 Java 는 단일 행 주석과 다중 행 주석을 제공하며 이를 활용해서 사용자 (프로그래머) 를 위한
 * 여러가지 메모를 작성하는 것이 가능하다.
 */
public class Main {
	/*
	 * 메인 메서드 (Main Method) 란?
	 * - Java 로 제작 된 프로그램이 실행 될 때 가장 먼저 호출되는 메서드를 의미한다. (+ 즉, 프로그램이 실행되면
	 * 가장 먼저 호출되는 메서드이기 때문에 진입 메서드라고도 불린다.)
	 *
	 * 메인 메서드가 호출되었다는 것은 프로그램이 실행되었다는 것을 의미하며 메인 메서드가 종료되었다는 것은
	 * 프로그램이 종료되었다는 것을 의미한다. (+ 즉, 메인 메서드의 실행 여부를 통해 프로그램의 실행 여부를
	 * 판단하는 것이 가능하다.)
	 *
	 * Java 명령문은 여러 파일에 작성하는 것이 가능하며 이때 해당 파일 중 어떤 파일에 존재하는 명령문을
	 * 가장 먼저 실행 할지 Java 컴파일러에게 알려 줄 필요가 있으며 이를 위해 존재하는 것이 메인 메서드이다.
	 */
	/** 메인 메서드 */
	public static void main(String[] args) {
//		CExample_01.start(args);
//		CExample_02.start(args);
//		CExample_03.start(args);
//		CExample_04.start(args);
//		CExample_05.start(args);
		CExample_06.start(args);
		
//		CTraining_01.start(args);
//		CTraining_02.start(args);
	}
}
