package Practice.Practice_01;

/**
 * Java 과제 1
 * - 회원 관리 프로그램 제작하기
 * - 회원 정보는 이름과 전화 번호 존재
 * - 회원 추가, 제거, 검색 가능 (+ 제거 및 검색은 이름으로 가능)
 * - 동일한 이름을 지닌 회원은 추가 불가
 * - 회원 정보를 관리 할 초기 배열 크기는 5 (+ 단, 5 를 초과 할 시 동적으로 배열 크기 조정)
 *
 * Ex)
 * =====> 메뉴 <=====
 * 1. 회원 추가
 * 2. 회원 제거
 * 3. 회원 검색
 * 4. 모든 회원 출력
 * 5. 종료
 *
 * 선택 : 1
 * 이름 입력 : 회원 A
 * 전화 번호 입력 : 1234
 *
 * Case 1. 신규 회원 일 경우
 * 회원 A 을(를) 추가 시켰습니다.
 *
 * Case 2. 동일한 이름의 회원이 존재 할 경우
 * 회원 A 은(는) 이미 추가 된 회원입니다.
 *
 * 선택 : 2
 * 이름 입력 : 회원 A
 *
 * Case 1. 회원이 존재 할 경우
 * 회원 A 을(를) 제거했습니다.
 *
 * Case 2. 회원이 없을 경우
 * 회원 A 은(는) 존재하지않습니다.
 *
 * 선택 : 3
 * 이름 입력 : 회원 A
 *
 * Case 1. 회원이 존재 할 경우
 * =====> 회원 정보 <=====
 * 이름 : 회원 A
 * 전화 번호 : 1234
 *
 * Case 2. 회원이 없을 경우
 * 회원 A 은(는) 존재하지않습니다.
 *
 * 선택 : 4
 * =====> 모든 회원 정보 <=====
 * 이름 : 회원 A
 * 전화 번호 : 1234
 *
 * 이름 : 회원 B
 * 전화 번호 : 1234
 *
 * ...이하 생략
 *
 * 선택 : 5
 * 프로그램을 종료합니다.
 */

/**
 * Practice 1
 */
public class CP01Practice_01 {
	/** 초기화 */
	public static void start(String[] args) {
		// Do Something
	}
}
